In [11]:
import numpy as np
import pandas as pd
from datetime import datetime
import seaborn as sns
import matplotlib.pyplot as plt
import pandas_datareader as pdr
%matplotlib inline

In [44]:
tickers = pd.read_csv('NASDAQ100_short.csv', parse_dates=['from', 'to'])

In [45]:
tickers

  ticker       from         to
0    AAL 2014-12-22        NaT
1   ADCT        NaT 2003-12-22
2   ADBE        NaT        NaT
3   VMED 1998-12-21 2000-10-27
4   VMED 2004-12-20 2008-12-22
5   VMED 2009-12-21 2013-06-05

In [49]:
tickers['from'].fillna(datetime(1990,1,1), inplace=True)
tickers['to'].fillna(datetime(2017,6,1), inplace=True)

In [50]:
tickers

  ticker       from         to
0    AAL 2014-12-22 2017-06-01
1   ADCT 1990-01-01 2003-12-22
2   ADBE 1990-01-01 2017-06-01
3   VMED 1998-12-21 2000-10-27
4   VMED 2004-12-20 2008-12-22
5   VMED 2009-12-21 2013-06-05